# AutoDetectIgnoreLeaderWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AutoDetectIgnoreLeaderWarning Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Analytical Model for Structural Element has reset to its default location.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AutoDetectIgnoreLeaderWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AutoDetectIgnoreLeaderWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AutoDetectIgnoreLeaderWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace